<?php
/* ----------------------------------------------------------------------------------------------------------------------------
    PAYMENTS
    config.php
   ---------------------------------------------------------------------------------------------------------------------------- */
$GLInstall='VOLOS';
$host='10.10.2.163';
$dbuser='csdb_volos';
$dbpassword='csdb_volos';
$dbservice='db1';
$dbType    ='oracle';
$GLOs=0;
$GLVathmos     = array(1=>'ÄÉÅÕÈ.' ,2=>'ÅÐÉÌ Á', 3=>'ÅÐÉÌ Â', 4=>'ÅÉÄÉÊ', 5=>'ÁÍÁÐ ÊÁÈ',6=>'ÊÁÈÇÃ',7=>'ÁÃÑÏÔ 14',8=>'ÁÃÑÏÔ 15',9=>'ÁÃÑÏÔ 16',10=>'ËÅÊÔÏÑ',11=>'ÅÐÉÊÏÕÑ',14=>'ËÏ×ÁÃÏÓ');
$GLMonthL      = array(1=> "ÉáíïõÜñéïò", "ÖåâñïõÜñéïò", "ÌÜñôéïò", "Áðñßëéïò", "ÌÜéïò", "Éïýíéïò", "Éïýëéïò", "Áýãïõóôïò", "ÓåðôÝìâñéïò", "Ïêôþâñéïò", "ÍïÝìâñéïò", "ÄåêÝìâñéïò","Äþñï ×ñéóôïõãÝííùí","Äþñï ÐÜó÷á","Åðßäïìá Áäåéáò");
$GLYear       = array(2010=>2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023,2024,2025,2026,2027,2028,2029,2030,2031,2032,2033,2034,2035,2036,2037,2038,2039);
$GLDiorismos   = 3;
$GLAnefApod    = 26;
$GLListIdaxid = array(2,3,25,31,35,49,108,112,125,129,142,146);
$GLListIdIatr  = array(2,5,1005);
$GLKatalogismos='40';

$Sign_L1[1]       = "ÅËËÇÍÉÊÇ ÄÇÌÏÊÑÁÔÉÁ";
$Sign_L2[1]       = "ÕÐÏÕÑÃÅÉÏ ÕÃÅÉÁÓ & ÊÏÉÍ.ÁËËÇËÅÃÃÕÇÓ";
$Sign_L3[1]       = "ÃÅÍÉÊÏ ÍÏÓÏÊÏÌÅÉÏ ÐÁÉÄÙÍ ÁÈÇÍÙÍ";
$Sign_L4[1]       = " \"ÐÁÍ. & ÁÃË. ÊÕÑÉÁÊÏÕ\" ";
$Sign_L5[1]       = "Í.Ð.Ä.Ä";

$Sign_L1[2]       = "ÅËËÇÍÉÊÇ ÄÇÌÏÊÑÁÔÉÁ";
$Sign_L2[2]       = "ÕÐÏÕÑÃÅÉÏ ÕÃÅÉÁÓ & ÊÏÉÍ.ÁËËÇËÅÃÃÕÇÓ";
$Sign_L3[2]       = "ÃÅÍÉÊÏ ÍÏÓÏÊÏÌÅÉÏ ÐÁÉÄÙÍ ÁÈÇÍÙÍ";
$Sign_L4[2]       = " \"ÐÁÍ. & ÁÃË. ÊÕÑÉÁÊÏÕ\" ";
$Sign_L5[2]       = "Í.Ð.Ä.Ä";

$Sign_L1[3]       = "ÅËËÇÍÉÊÇ ÄÇÌÏÊÑÁÔÉÁ";
$Sign_L2[3]       = "ÕÐÏÕÑÃÅÉÏ ÕÃÅÉÁÓ & ÊÏÉÍ.ÁËËÇËÅÃÃÕÇÓ";
$Sign_L3[3]       = "ÃÅÍÉÊÏ ÍÏÓÏÊÏÌÅÉÏ ÐÁÉÄÙÍ ÁÈÇÍÙÍ";
$Sign_L4[3]       = " \"ÐÁÍ. & ÁÃË. ÊÕÑÉÁÊÏÕ\" ";
$Sign_L5[3]       = "Í.Ð.Ä.Ä";

$Sign_L1[4]       = "ÅËËÇÍÉÊÇ ÄÇÌÏÊÑÁÔÉÁ";
$Sign_L2[4]       = "ÕÐÏÕÑÃÅÉÏ ÕÃÅÉÁÓ & ÊÏÉÍ.ÁËËÇËÅÃÃÕÇÓ";
$Sign_L3[4]       = "ÃÅÍÉÊÏ ÍÏÓÏÊÏÌÅÉÏ ÐÁÉÄÙÍ ÁÈÇÍÙÍ";
$Sign_L4[4]       = " \"ÐÁÍ. & ÁÃË. ÊÕÑÉÁÊÏÕ\" ";
$Sign_L5[4]       = "Í.Ð.Ä.Ä";

$Sign_L1[5]       = "ÅËËÇÍÉÊÇ ÄÇÌÏÊÑÁÔÉÁ";
$Sign_L2[5]       = "ÕÐÏÕÑÃÅÉÏ ÕÃÅÉÁÓ & ÊÏÉÍ.ÁËËÇËÅÃÃÕÇÓ";
$Sign_L3[5]       = "ÃÅÍÉÊÏ ÍÏÓÏÊÏÌÅÉÏ ÐÁÉÄÙÍ ÁÈÇÍÙÍ";
$Sign_L4[5]       = " \"ÐÁÍ. & ÁÃË. ÊÕÑÉÁÊÏÕ\" ";
$Sign_L5[5]       = "Í.Ð.Ä.Ä";

$Sign_L1[6]       = "ÅËËÇÍÉÊÇ ÄÇÌÏÊÑÁÔÉÁ";
$Sign_L2[6]       = "ÕÐÏÕÑÃÅÉÏ ÕÃÅÉÁÓ & ÊÏÉÍ.ÁËËÇËÅÃÃÕÇÓ";
$Sign_L3[6]       = "ÃÅÍÉÊÏ ÍÏÓÏÊÏÌÅÉÏ ÐÁÉÄÙÍ ÁÈÇÍÙÍ";
$Sign_L4[6]       = " \"ÐÁÍ. & ÁÃË. ÊÕÑÉÁÊÏÕ\" ";
$Sign_L5[6]       = "Í.Ð.Ä.Ä";
$SessionLifeTime = 3600;
$SessionName='Computer_Solutions_Payments';
$MaximumExecutionTime =120;
$rootpath = dirname($_SERVER['PHP_SELF']);
if ($rootpath=="/" || $rootpath=="\\") { $rootpath=""; }
error_reporting (E_ALL & ~E_NOTICE);
?>
